[{"year": "90th–50th century BCE", "date": "None", "content": "Marker"}, {"year": "9,000 BCE", "date": "None", "content": "Early Neolithic culture with first confirmed semi permanent settlements appeared 11000 years ago in the Bhimbetka rock shelters in modern Madhya Pradesh, India. Some of the Stone Age rock paintings found among the Bhimbetka rock shelters are approximately 30,000 years old.[14]\nThe ancient history of the region includes some of South Asia's oldest settlements[15] and some of its major civilisations.[16][17]"}, {"year": "50th–40th century BCE", "date": "None", "content": "Marker"}, {"year": "4000 BCE", "date": "None", "content": "Phase of the Indus Valley Civilisation begins. The civilization used an early form of the Indus signs, now called Indus script.\nOver the course of next 1000–1500 years, inhabitants of the Civilization developed new techniques in handicraft (carnelian products, seal carving) and metallurgy (copper, bronze, lead, and tin) had elaborate urban planning, baked brick houses, efficient drainage systems, water supply systems, and clusters of large non-residential buildings.[18]\nThe civilization depended significantly on trade, was the first civilization to use wheeled transport in form of bullock carts, and also used boats.[19]"}, {"year": "30th century BCE-20th century BCE", "date": "None", "content": "Marker"}, {"year": "2800 BCE", "date": "None", "content": "The Indus Valley Civilization expands across the whole of Pakistan, much of northern India, and large parts of Afghanistan, with Harappa and Mohenjo-daro becoming large metropolises.[20]"}, {"year": "2600 BCE", "date": "None", "content": "End of the Early Indus Valley Civilization culture. Start of Mature Indus Valley Civilization culture"}, {"year": "19th century BCE", "date": "None", "content": "Marker"}, {"year": "1900 BCE", "date": "None", "content": "End of Mature Indus Valley Civilization culture, late Indus Valley Civilization period starts"}, {"year": "18th century BCE", "date": "None", "content": "Marker"}, {"year": "1800 BCE", "date": "None", "content": "Adichanallur urn-burial site in Tirunelveli district in Tamil Nadu. In 2004, a number of skeletons dating from around 3,800 years ago."}, {"year": "17th century BCE", "date": "None", "content": "Marker"}, {"year": "1700 BCE", "date": "None", "content": "Brihadratha also known as Maharatha, was the initiator of the Brihadratha dynasty, the earliest ruling dynasty of Magadha."}, {"year": "1700 BCE", "date": "None", "content": "Jarasandha was the son of Brihadratha and became the 2nd ruler of the Barhadratha dynasty of Magadha succeeding his father"}, {"year": "1700 BCE", "date": "None", "content": "Sahadeva of Magadha became the 3rd ruler of the Barhadratha dynasty of Magadha succeeding Jarasandha"}, {"year": "1661 BCE", "date": "None", "content": "Somadhi became the 4th ruler of the Barhadratha dynasty of Magadha succeeding Sahadeva of Magadha"}, {"year": "1603 BCE", "date": "None", "content": "Srutasravas became the 5th ruler of the Barhadratha dynasty of Magadha succeeding Somadhi"}, {"year": "16th century BC", "date": "None", "content": "Marker"}, {"year": "1539 BCE", "date": "None", "content": "Ayutayus became the 6th ruler of the Barhadratha dynasty of Magadha succeeding Srutasravas"}, {"year": "1503 BCE", "date": "None", "content": "Niramitra became the 7th ruler of the Barhadratha dynasty of Magadha succeeding Ayutayus"}, {"year": "15th century BCE", "date": "None", "content": "Marker"}, {"year": "1500 BCE", "date": "None", "content": "Early Vedic period (to 1000 BCE)"}, {"year": "1463 BCE", "date": "None", "content": "Sukshatra became the 8th ruler of the Barhadratha dynasty of Magadha succeeding Niramitra"}, {"year": "1405 BCE", "date": "None", "content": "Brihatkarman became the 9th ruler of the Barhadratha dynasty of Magadha succeeding Sukshatra"}, {"year": "14th century BCE", "date": "None", "content": "Marker"}, {"year": "1400 BCE", "date": "None", "content": "Gopala Dynasty established by Gopa"}, {"year": "1382 BCE", "date": "None", "content": "Senajit became the 10th ruler of the Barhadratha dynasty of Magadha succeeding Brihatkarman"}, {"year": "1332 BCE", "date": "None", "content": "Srutanjaya became the 11th ruler of the Barhadratha dynasty of Magadha succeeding Senajit"}, {"year": "13th century BCE", "date": "None", "content": "Marker"}, {"year": "1300 BCE", "date": "None", "content": "Cemetery H culture comes to an end"}, {"year": "1300 BCE", "date": "None", "content": "End of late Indus Valley Civilization period"}, {"year": "1292 BCE", "date": "None", "content": "Vipra became the 12th ruler of the Barhadratha dynasty of Magadha succeeding Srutanjaya"}, {"year": "1280 BCE", "date": "None", "content": "Pundravardhana Kingdom was established sometime before 1280 BCE."}, {"year": "1257 BCE", "date": "None", "content": "Suchi became the 13th ruler of the Barhadratha dynasty of Magadha succeeding Vipra"}, {"year": "12th century BCE", "date": "None", "content": "Marker"}, {"year": "1200 BCE", "date": "None", "content": "Rigveda"}, {"year": "1199 BCE", "date": "None", "content": "Kshemya became the 14th ruler of the Barhadratha dynasty of Magadha succeeding Suchi"}, {"year": "1171 BCE", "date": "None", "content": "Subrata became the 15th ruler of the Barhadratha dynasty of Magadha succeeding Kshemya"}, {"year": "1107 BCE", "date": "None", "content": "Dharma became the 16th ruler of the Barhadratha dynasty of Magadha succeeding Subrata"}, {"year": "11th century BCE", "date": "None", "content": "Marker"}, {"year": "1043 BCE", "date": "None", "content": "Dharma stepped down as the 16th ruler of the Barhadratha dynasty of Magadha."}, {"year": "1008 BCE", "date": "None", "content": "Susuma became the 17th ruler of the Barhadratha dynasty of Magadha succeeding Dharma"}, {"year": "10th century BCE", "date": "None", "content": "Marker"}, {"year": "1000 BCE", "date": "None", "content": "Middle and Late Vedic period (to 500 BCE)"}, {"year": "1000 – 300 BCE", "date": "None", "content": "Kanchi district, gold mine of Megalithic sites in Tamil Nadu, South India[21]"}, {"year": "1000- 900 BCE", "date": "None", "content": "Kingdom of Videha was established."}, {"year": "1000- 900 BCE", "date": "None", "content": "Panchala Kingdom was established."}, {"year": "970 BCE", "date": "None", "content": "Dridhasena became the 18th ruler of the Barhadratha dynasty of Magadha succeeding Susuma"}, {"year": "912 BCE", "date": "None", "content": "Sumati became the 19th ruler of the Barhadratha dynasty of Magadha succeeding Dridhasena"}, {"year": "9th century BCE", "date": "None", "content": "Marker"}, {"year": "879 BCE", "date": "None", "content": "Subala became the 20th ruler of the Barhadratha dynasty of Magadha succeeding Sumati"}, {"year": "877 BCE", "date": "None", "content": "Birth of Parsvanatha, 23rd Jain Tirthankara (traditional date)"}, {"year": "857 BCE", "date": "None", "content": "Sunita became the 21st ruler of the Barhadratha dynasty of Magadha succeeding Subala"}, {"year": "841 BCE", "date": "None", "content": "Gopala Dynasty was de-established."}, {"year": "817 BCE", "date": "None", "content": "Satyajit became the 22nd ruler of the Barhadratha dynasty of Magadha succeeding Sunita"}, {"year": "8th century BCE", "date": "None", "content": "Marker"}, {"year": "767 BCE", "date": "None", "content": "Viswajit became the 23rd ruler of the Barhadratha dynasty of Magadha succeeding Satyajit"}, {"year": "732 BCE", "date": "None", "content": "Ripunjaya became the 24th and the last ruler of the Barhadratha dynasty of Magadha succeeding Viswajit."}, {"year": "7th century BCE", "date": "None", "content": "Marker"}, {"year": "700 BCE", "date": "None", "content": "The Upanishads, a sacred text of Hinduism, are written."}, {"year": "700 BCE", "date": "None", "content": "Kingdom of Kosala was established. Kosala belonged to the Northern Black Polished Ware culture (c. 700–300 BCE)."}, {"year": "6th century BCE", "date": "None", "content": "Marker"}, {"year": "600 BCE", "date": "None", "content": "Sixteen Maha Janapadas (\"Great Realms\" or \"Great Kingdoms\") emerge."}, {"year": "600 BCE", "date": "None", "content": "The Vedic period ends."}, {"year": "600 BCE", "date": "None", "content": "The Chola, Pandya, and Chera dynasties are established."}, {"year": "600 BCE", "date": "None", "content": "The capital of the Early Pandyan Kingdom was initially Korkai, all around 600 BCE, and was later moved to Koodal (now Madurai) during the reign of Nedunjeliyan I."}, {"year": "599 BCE", "date": "None", "content": "Mahavira of the 24th Tirthankara is born. This turns out to become the most famous wave of Jainism."}, {"year": "563 BCE", "date": "None", "content": "Siddhārtha Gautama, Buddha-to-be, is born in Lumbini into a leading royal family in the republic of the Shakyas, which is now part of Nepal."}, {"year": "543 BCE", "date": "None", "content": "The Vanga-based Prince Vijaya (c. 543 BCE) married a daughter of the Pandyan king of Madurai, to whom he was sending rich presents every year. Sinhala chronicle Mahawamsa mentions this event[citation needed]"}, {"year": "538 BCE", "date": "None", "content": "Cyrus the Great, founder of the Persian Achaemenid Empire reached up to northwestern parts of the Indian subcontinent, today's Afghanistan, which later proved to be his nemesis and caused his death."}, {"year": "527 BCE", "date": "None", "content": "Nirvana of Mahavira,"}, {"year": "525 BCE", "date": "None", "content": "Kuru Kingdom was de-established."}, {"year": "5th century BCE", "date": "None", "content": "Marker"}, {"year": "483 BCE", "date": "None", "content": "Proposed Mahaparinirvana date of Gautama Buddha at Kushinagar."}, {"year": "4th century BCE", "date": "None", "content": "Marker"}, {"year": "400 BCE", "date": "None", "content": "Siddhartha Gautama 'Buddha' of the Shakya polity in S. Nepal, finds Buddhism (older date: 563–483 BCE)"}, {"year": "350 BCE", "date": "None", "content": "Panini, labelled as the father of linguistics, a resident of Gandhara, describes the grammar and morphology of Sanskrit in the text Ashtadhyayi. Panini's standardized Sanskrit is known as Classical Sanskrit."}, {"year": "333 BCE", "date": "None", "content": "Persian rule in the northwest ends after Darius 3 is defeated by Alexander the Great, who establishes the Macedonian Empire after inheriting the Persian Achaemenid Empire."}, {"year": "326 BCE", "date": "None", "content": "Ambhi king of Takshila surrenders to Alexander."}, {"year": "326 BCE", "date": "None", "content": "Porus who ruled parts of the Punjab, fought Alexander at the Battle of the Hydaspes River."}, {"year": "321 BCE", "date": "None", "content": "Maurya Empire is founded by Chandragupta Maurya in Magadha after he defeats the Nanda dynasty and Macedonian Seleucid Empire. Mauryan capital city is Pataliputra (Modern Patna in Bihar)"}, {"year": "305 BCE", "date": "None", "content": "Chandragupta Maurya defeats Seleucus Nicator of the Seleucid Empire."}, {"year": "304 BCE", "date": "None", "content": "Seleucus gives up his territories in the subcontinent (Afghanistan/Baluchistan) to Chandragupta in exchange for 500 elephants. Seleucus offers his daughter in marriage to Chandragupta to seal their friendship."}, {"year": "3rd century BCE", "date": "None", "content": "Marker"}, {"year": "Unknown", "date": "None", "content": "Pingala, ancient Indian mathematician and poet writes the Chandaḥśāstra (also called the Pingala-sutras), which presents the first known description of a binary numeral system."}, {"year": "273 BCE", "date": "None", "content": "Ashoka the Great regarded as the greatest ancient Indian emperor, grandson of Chandragupta Maurya, ascends as emperor of the Maurya Empire."}, {"year": "266 BCE", "date": "None", "content": "Ashoka conquers and unifies most of South Asia, along with most of Afghanistan and Balochistan."}, {"year": "265 BCE", "date": "None", "content": "Kalinga War takes place between Ashoka and the kingdom of Kalinga."}, {"year": "265 BCE", "date": "None", "content": "After conquering Kalinga, Ashoka reportedly regrets what he has done, leading him to adopt Buddhism, which then becomes the quasi-official state religion of the Mauryan Empire."}, {"year": "261 BCE", "date": "None", "content": "Conquest of Kalinga"}, {"year": "260 BCE", "date": "None", "content": "Ashoka inscribes the Edicts of Ashoka, written down using Brahmi script. The Edicts describe his Buddhist religious views and his commitment to the welfare of his subjects."}, {"year": "232 BCE", "date": "None", "content": "Ashoka dies and is succeeded by Kunala."}, {"year": "230 BCE", "date": "None", "content": "Simuka declares independence from Mauryan rule and establishes the Satavahana Empire."}, {"year": "2nd century BCE", "date": "None", "content": "Marker"}, {"year": "200 BCE", "date": "None", "content": "Kuninda Kingdom is established."}, {"year": "200 BCE", "date": "None", "content": "Tolkāppiyam describes the grammar and morphology of Tamil; it is the oldest existing Tamil grammar (dates vary between 200 BCE and 100 CE). (to 100 BC)"}, {"year": "200 BCE", "date": "None", "content": "Indo-Greek Kingdom (also known as the Yavana Kingdom) is established. It was a Hellenistic-era Greek kingdom covering  various parts of Afghanistan and the northwestern regions of the Indian subcontinent (parts of modern-day Pakistan and northwestern India). The kingdom was founded when the Graeco-Bactrian king Demetrius (and later Eucratides) invaded India from Bactria in 200 BC. During its existence, the kingdom was ruled over by 30 successive kings, with Menander I being the most famous Indo-Greek king."}, {"year": "184 BCE", "date": "None", "content": "The Mauryan Empire, declines"}, {"year": "165/155 BCE", "date": "None", "content": "Menander I becomes the king of the Indo-Greek Kingdom. Menander is noted for having become a patron and convert to Greco-Buddhism and he is widely regarded as the greatest of the Indo-Greek kings."}, {"year": "1st century BCE", "date": "None", "content": "Marker"}, {"year": "100 BCE", "date": "None", "content": "Birth of Charaka, ancient Indian physician who writes the Charaka Samhita, an ancient text that describes theories on human body, etiology, symptomology and therapeutics for a wide range of diseases and is based on the Agnivesha Samhitā."}, {"year": "65 BCE", "date": "None", "content": "The Pandyan king sends ambassadors to the Greek and Roman lands."}, {"year": "58 BCE", "date": "None", "content": "Beginning of Vikram Era"}, {"year": "1 BCE", "date": "None", "content": "Fall of the Indo-Greek Kingdom."}, {"year": "1st century ", "date": "None", "content": "Marker"}, {"year": "35", "date": "None", "content": "Western Satraps formed."}, {"year": "52", "date": "None", "content": "St. Thomas arrives in Muziris (modern-day North Paravur and Kodungalloor in Kerala State, India)."}, {"year": "68", "date": "None", "content": "Establishment of the Kushan Empire by Kujula Kadphises."}, {"year": "78", "date": "None", "content": "Gautamiputra Satkarni becomes Satavahana emperor and starts Shalivahana era calendar after defeating Scythian king Maues."}, {"year": "100 or after", "date": "None", "content": "Sugar was first produced from sugarcane plants in northern India sometime after the first century.[22]"}, {"year": "2nd century ", "date": "None", "content": "Marker"}, {"year": "113", "date": "None", "content": "Vima Kadphises becomes the ruler of the Kushan Empire. He was the Kushan Emperor to first introduce gold coinage, in addition to the existing silver and copper coinage."}, {"year": "127", "date": "None", "content": "Kanishka ascends the throne of the Kushan Empire, succeeding Vima Kadphises. Under his reign, the Kushan Empire reached its zenith."}, {"year": "3rd century", "date": "None", "content": "Marker"}, {"year": "240", "date": "None", "content": "Sri-Gupta starts the Gupta Empire in Magadha, with its capital in Pataliputra"}, {"year": "250", "date": "None", "content": "The Vakataka Dynasty in the Deccan is formed by Vindyashakti. He rules until 275."}, {"year": "275", "date": "None", "content": "The Pallava dynasty is established"}, {"year": "275", "date": "None", "content": "Pravarasena ascends the throne of the Vakataka Dynasty, expanding his empire. He was the first Vakataka ruler who called himself a Samrat, or emperor. He is perhaps the only emperor in his dynasty."}, {"year": "4th century", "date": "None", "content": "Marker"}, {"year": "320", "date": "None", "content": "Chandragupta I ascends the Gupta throne."}, {"year": "335", "date": "None", "content": "Samudragupta ascends the Gupta throne and expands the empire."}, {"year": "345", "date": "None", "content": "Kadamba Kingdom established by Mayurasharma, Banavasi as its capital and they were the first kingdom to use Kannada in administration."}, {"year": "380", "date": "None", "content": "Chandragupta II, Samudragupta's son becomes the Gupta Emperor."}, {"year": "390", "date": "None", "content": "Prabhavatigupta, a Gupta Princess who was the daughter of Chandragputa II, becomes the regent of the Vakataka dynasty after the death of her husband Rudrasena II, effectively ruling the Vakatakas until 410."}, {"year": "5th century", "date": "None", "content": "Marker"}, {"year": "413", "date": "None", "content": "Kumaragupta I, Adopted the title of Mahendraditya."}, {"year": "455", "date": "None", "content": "Skandagupta, Faced Hunas effectively."}, {"year": "467", "date": "None", "content": "Invasions by the Huna.\nPallavas became a major power during the reign of Mahendravarman I (571 – 630 CE)"}, {"year": "475", "date": "None", "content": "Harishena takes over the Vakataka Dynasty. He was a great patron of Buddhist Art. The World Heritage monument Ajanta Caves is surviving example of his works."}, {"year": "476", "date": "None", "content": "Birth of Aryabhata, ancient Indian mathematician and astronomer who goes on to write the Aryabhatiya, a Sanskrit astronomical treatise and the Arya-siddhanta."}, {"year": "6th century", "date": "None", "content": "Marker"}, {"year": "502", "date": "None", "content": "Mihirakula becomes the ruler of the Alchon Huns. He was the second and last of the Alchon Huns. He was considered to be an extremely violent and cruel ruler. He destroyed many Buddhist monasteries in his kingdom."}, {"year": "528", "date": "None", "content": "Confederation of Indian rulers Yashodharman, Narasimhagupta and Adityavardhana defeat the Huna emperor Mihirakula in the Battle of Sondani."}, {"year": "528", "date": "528–540", "content": "Yashodharman conquers vast territories from the Hunas and Guptas after the Battle of Sondani, and establishes the short-lived Aulikara Empire"}, {"year": "554", "date": "None", "content": "Collapse of Gupta Empire after the death of Vishnugupta."}, {"year": "573", "date": "None", "content": "Varāhamihira, ancient Indian astrologer, astronomer, and polymath writes the Pañcasiddhāntikā, a treatise on mathematical astronomy and which summarises five earlier astronomical treatises by five authors."}, {"year": "7th century", "date": "None", "content": "Marker"}, {"year": "606", "date": "None", "content": "Harshavardhana crowned Monarch."}, {"year": "628", "date": "None", "content": "Ancient Indian mathematician and astronomer Brahmagupta completes the Brāhmasphuṭasiddhānta, a text on mathematical astronomy explaining the role of zero, rules for manipulating both negative and positive numbers, a method for computing square roots, methods of solving linear and quadratic equations, and rules for summing series, Brahmagupta's identity,  and Brahmagupta's theorem. Brahmagupta also first describes gravity as an attractive force, and uses the term \"gurutvākarṣaṇam (गुरुत्वाकर्षणम्)]\" in Sanskrit to describe it.[23]"}, {"year": "637", "date": "None", "content": "Badami Chalukya power at its peak. Pulakeshin II pushes north up to the Narmada and defeats the invading Harshavardhana of Kanauj"}, {"year": "665", "date": "None", "content": "Ancient Indian mathematician and astronomer Brahmagupta completes the astronomical treatise Khandakhadyaka covering topics such as the longitudes of the planets, diurnal rotation, lunar and solar eclipses, risings and settings, the moon's crescent and conjunctions of the planets."}, {"year": "8th century", "date": "None", "content": "Marker"}, {"year": "700", "date": "None", "content": "According to the Qissa-i Sanjan, the immigrants Parsi are granted permission to stay by the local ruler Jadi Rana"}, {"year": "711", "date": "None", "content": "Arab commander of the Umayyad Caliphate, Muhammad ibn Qasim defeats Raja Dahir, king of Sindh Region in modern-day Pakistan"}, {"year": "728", "date": "None", "content": "Narasimhavarman II of the Pallava dynasty constructs the Shore Temple of Mamallapuram"}, {"year": "736", "date": "None", "content": "Delhi is re-established by Bilan Deo Tomar also known as Anangpal Tomar"}, {"year": "738", "date": "None", "content": "Confederacy of Indian kings consisting of Nagabhata I of Gurjara-Pratihara dynasty and Bappa Rawal, ruler of Mewar defeat Arab Umayyad Caliphate invasion attempts in the Battle of Rajasthan (738 CE)"}, {"year": "739", "date": "None", "content": "Avanijanashraya Pulakeshin of the Chalukyas of Navasarika kingdom defeats an invasion attempt by the Arab Umayyad Caliphate.[24]"}, {"year": "753", "date": "None", "content": "Establishment of Rashtrakuta Kingdom of Manyakhet by Dantidurga by defeating Chalukyas of Badami"}, {"year": "753", "date": "None", "content": "Saindhava naval fleet defeats Arab naval fleet sent by the Arab governor of Sindh."}, {"year": "776", "date": "None", "content": "Saindhava naval fleet under Agguka I defeats second Arab naval expedition.[25][26]"}, {"year": "788", "date": "None", "content": "Birth of Adi Shankara"}, {"year": "9th century", "date": "None", "content": "Marker"}, {"year": "800", "date": "None", "content": "Vikramashila University is established by the Pala emperor Dharmapala in present day Bhagalpur district in Bihar, in early 9th century"}, {"year": "814", "date": "None", "content": "Nripatunga Amoghavarsha I becomes Rashtrakuta emperor. Kannada literature flourishes."}, {"year": "836", "date": "None", "content": "Gurjara-Pratihara (to 910)"}, {"year": "10th century", "date": "None", "content": "Marker"}, {"year": "935", "date": "None", "content": "Chandrapur University established in 935 CE by Srichandra, a ruler of the Chandra dynasty"}, {"year": "985", "date": "None", "content": "Rajaraja Chola ascends to the throne of Chola empire. He expands the empire to Sri Lanka and to the north to include Kalinga kingdom"}, {"year": "993", "date": "None", "content": "Rajaraja Chola invades Sri Lanka and captures the northern half of Sri Lanka."}, {"year": "11th century ", "date": "None", "content": "Marker"}, {"year": "1000", "date": "None", "content": "Invasion of Mahmud of Ghazni"}, {"year": "1000", "date": "1003–1010", "content": "The Brihadisvara Temple, Thanjavur is built by Raja Raja Chola I."}, {"year": "1014", "date": "None", "content": "Rajaraja Chola adds the Lakshadweep and Maldives islands to the Chola empire.[27]"}, {"year": "1014", "date": "None", "content": "Rajendra Chola I became the king of Chola empire after his father Rajaraja Chola. During his reign, he extended the influences of the already vast Chola empire up to the banks of the river Ganges in the north and across the ocean. Rajendra's territories extended coastal Burma, the Andaman and Nicobar Islands, Lakshadweep, Maldives, conquered the kings of Srivijaya (Sumatra, Java and Malay Peninsula in South East Asia) and Pegu islands with his fleet of ships. He defeated Mahipala, the Pala king of Bengal and Bihar, and to commemorate his victory he built a new capital called Gangaikonda Cholapuram. The Cholas became one of the most powerful dynasties in Asia during his reign. The Tamil Chola armies exacted tribute from Thailand and the Khmer kingdom of Cambodia. Rajendra Chola I was the first Indian king to take his armies overseas and make conquests of these territories, even though there is epigraphical evidence of Pallava presence in these very areas."}, {"year": "1014", "date": "None", "content": "Mahmud Ghazni defeats the Hindu Shahi king Trilochanapala and annexes Punjab.\nHe then attempts to invade Kashmir, but is defeated by Samgrāmarāja"}, {"year": "1017", "date": "26 April", "content": "Sri Ramanujacharya is born at Sriperumbudur, Tamil Nadu."}, {"year": "1021", "date": "None", "content": "Mahmud of Ghazni again attempts to invade Kashmir, but is defeated by Samgrāmarāja"}, {"year": "1025", "date": "30 April", "content": "Last invasion of Mahmud Ghazni, sacked and destroyed temple of Somnath"}, {"year": "1027", "date": "None", "content": "The Sun Temple of Modhera is completed by Bhima I of the Chaulukya dynasty"}, {"year": "1030", "date": "30 April", "content": "Alberuni arrives in India; death of Mahmud of Ghazni"}, {"year": "1033", "date": "15 June", "content": "Suhaldev, king of Shravasti defeats and kills Ghazi Saiyyad Salar Masud, nephew of Mahmud of Ghazni."}, {"year": "1035", "date": "None", "content": "The Brihadisvara Temple, Gangaikonda Cholapuram is built by Rajendra Chola I."}, {"year": "1058", "date": "None", "content": "Soomra dynasty ends the Arab domination and establishes its own rule over Sindh."}, {"year": "12th century", "date": "None", "content": "Marker"}, {"year": "1120", "date": "None", "content": "Kalyani Chalukyas power at its peak. Vikramaditya VI ushers in Vikrama Chalukya era."}, {"year": "1121", "date": "None", "content": "Ajayaraja II, of the Chahamanas of Shakambhari dynasty repulse Ghaznavid invasions."}, {"year": "1134", "date": "None", "content": "Life of Basaveshwara, philosopher and social reformer. (to 1196)"}, {"year": "1150", "date": "None", "content": "Bhāskara II, mathematician and astronomer writes the Siddhānta Shiromani, consisting of three books Līlāvatī on arithmetic and measurement, Bijaganita on algebra and Gaṇitādhyāya and Golādhyāya on astronomy."}, {"year": "1157", "date": "None", "content": "The Kalachuris of Kalyani under Bijjala II capture Kalyani"}, {"year": "1175", "date": "None", "content": "Muhammad of Ghor invades India.[28]"}, {"year": "1178", "date": "None", "content": "Forces of the Chaulukya king Mularaja II led by his regent mother Naikidevi defeat Ghurid invaders led by Muhammad of Ghor who escapes back to Ghazni, in the Battle of Kasahrada."}, {"year": "1191", "date": "None", "content": "First Battle of Tarain between Mohammed Ghori and Prithviraj III. Ghori is defeated by Prithivi Raj Chauhan III."}, {"year": "1192", "date": "None", "content": "Second Battle of Tarain fought between Muhammed Ghori and Prithviraj Chauhan III. Prithviraj Chauhan III is defeated by Mohammed Ghori."}, {"year": "1193", "date": "None", "content": "Muslim general Muhammad bin Bakhtiyar Khalji destroys the ancient university of Vikramashila"}, {"year": "1194", "date": "None", "content": "Battle of Chandawar fought between Muhammad of Ghor and Jaichand of Kannauj. Ghori defeated Jayachandra and killed him."}, {"year": "13th century", "date": "None", "content": "Marker"}, {"year": "1206", "date": "15 March", "content": "Khokhars killed Muhammad Ghori during a raid on his camp on the Jhelum River"}, {"year": "1206", "date": "12 June", "content": "Qutb ud-Din Aibak establishes slave Dynasty later to be known as Delhi Sultanate"}, {"year": "1206", "date": "None", "content": "Raja Prithu defeats Muhammad Bakhtiyar Khalji, destroying his army of 12,000 with only about 100 survivors.[29][30]"}, {"year": "1210", "date": "None", "content": "Qutb-ud-din Aibak died while playing polo."}, {"year": "1210", "date": "None", "content": "Shams ud-Din Iltutmish;was the third ruler of the Delhi Sultanate, belonging to the Mamluk dynasty (Slave Dynasty). He introduced IQTA (Tax, revenue) system. Died in 1236"}, {"year": "1210", "date": "1211–1215", "content": "Anangabhima Deva III of the Eastern Ganga dynasty in present-day Odisha defeats invasions by Ghiyāth ad-Dīn ʿIwaz Khalji the ruler of Bengal.[31]"}, {"year": "1221", "date": "None", "content": "Genghis Khan invades Punjab in pursuit of the fleeing Khwarezm Shah Jalal ad-Din Mingburnu and defeats him in the Battle of the Indus."}, {"year": "1226", "date": "None", "content": "Raja Prithu repulses invading forces of Ghiyas ud din Balban the ninth sultan of the Mamluk dynasty of Delhi, in present-day Assam[29][30]"}, {"year": "1229", "date": "None", "content": "Sandhya (ruler of Kamarupa) in present-day Assam drives Muslims out of his territory and captures territory till Karatoya river. Thereafter, to avenge previous defeats, he invades the western border of Gaur (Lakhnauti) and annexes regions across the Karatoya into his kingdom."}, {"year": "1236", "date": "None", "content": "Narasingha Deva I ruler of the Eastern Ganga dynasty in present-day Odisha launches attacks against the Turko-Afghan rulers of Mamluk dynasty in Bengal that had captured Bihar and Bengal and not only repulses their attacks, but pushes them as far back as Padma River in current-day Bangladesh.[31]"}, {"year": "1236", "date": "10 November", "content": "Rule of Razia Sultana – Daughter of Iltutmish."}, {"year": "1238", "date": "October", "content": "Sri Madhwacharya born in Pajaka near Udupi, Karnataka"}, {"year": "1240", "date": "14 October", "content": "Murder of Razia Sultan by Turkish nobles.(Chalisa)"}, {"year": "1243", "date": "None", "content": "Narasingha Deva I ruler of the Eastern Ganga dynasty defeats Tughral Tughan Khan of the Mamluk Sultanate of Delhi in the Battle of Katasin and annexes several districts of Bengal into his empire."}, {"year": "1243", "date": "1246–66", "content": "Rule of Nasiruddin Mahmud with support of Balban (Wazir and powerful member of Chalisa). Chalisa- a council of 40 members"}, {"year": "1250", "date": "None", "content": "The Konark Sun Temple is completed, built by Narasingha Deva I."}, {"year": "1257", "date": "None", "content": "The Kamrup kingdom, led by its ruler Sandhya defeats and executes Malik Ikhtiyaruddin Yuzbak, the Mamluk Governor of Bengal. His domains are split between the Kamrup kingdom and Narasimhadeva I of the Eastern Ganga Empire."}, {"year": "1257", "date": "1266–1286", "content": "Rule of Balban; Chalisa wiped out."}, {"year": "1267", "date": "None", "content": "The Mahanubhava philosophy established by Chakradhar Swami."}, {"year": "1275", "date": "None", "content": "Birth of saint Dnyaneshwar."}, {"year": "1290", "date": "None", "content": "Murder of Muiz ud din Qaiqabad by Jalaluddin Firuz Khalji, an army commander."}, {"year": "1290", "date": "1290–96", "content": "Jalal-ud-din Khilji. Founder of Khiliji Dynasty"}, {"year": "14th century", "date": "None", "content": "Marker"}, {"year": "1309", "date": "None", "content": "Alauddin Khalji sends Malik Kafur to South. Malik Kafur Lays siege on the Kakatiya Capital Warangal and Extracts Tribute.  The diamond Kohinoor was among the loot collected."}, {"year": "1310", "date": "None", "content": "Ala-ud-din Khilji's army under Malik Kafur occupies Devagiri ending the Seuna Yadava Kingdom"}, {"year": "1311", "date": "None", "content": "Malik Kafur attacks the Hoyasalas. In the aftermath of the destruction Hoyasalas abandon the old capital Halebidu. He later attacks Madurai. The attacks on Warangal, Halebidu and Madurai is accompanied by wide scale killing, destruction of temples and repatriation of wealth back to Delhi."}, {"year": "1323", "date": "None", "content": "Ulugh Khan (Muhammad bin Tughluq) defeats Prataparudra II ending the Kakatiya dynasty"}, {"year": "1333", "date": "None", "content": "Prithvi Chand II of the Hindu Katoch kingdom of Kangra defeats the army of Muhammad bin Tughluq who loses nearly all his 10,000 soldiers and is forced to retreat.[32]"}, {"year": "1334", "date": "None", "content": "Musunuri Kapaya Nayaka with assistance from the Hoysala ruler Veera Ballala III leads a rebellion against the Tughluq rule of Delhi Sultanate, driving it out of Warangal region in present-day Telangana."}, {"year": "1336", "date": "None", "content": "Vijayanagara Empire established by Harihara I and his brother Bukka Raya I."}, {"year": "1336", "date": "None", "content": "Rana of Mewar Hammir Singh defeats and captures Tughlaq dynasty ruler Muhammad bin Tughluq in the Battle of Singoli."}, {"year": "1340", "date": "None", "content": "Birth of great mathematician Madhava of Sangamagrama who goes on to found the Kerala school of astronomy and mathematics and write the Venvaroha, which describes the methods for the computation of the true positions of the Moon at intervals of about half an hour for various days in an anomalistic cycle."}, {"year": "1343", "date": "None", "content": "Veera Ballala III captured and killed in the Battle of Kannanur."}, {"year": "1347", "date": "None", "content": "Governor Hasan Gangu revolts against Muhammad bin Tughluq founding the Bahmani Sultanate"}, {"year": "1351", "date": "None", "content": "Samma Dynasty assumes rule over Sindh"}, {"year": "1370", "date": "None", "content": "Bukka, the Vijayanagara ruler and his son Kumara Kamapna capture the entire Tamil speaking parts."}, {"year": "1398", "date": "None", "content": "Timur plunders Lahore"}, {"year": "15th century", "date": "None", "content": "Marker"}, {"year": "1401", "date": "None", "content": "Dilawar Khan establishes the Malwa Sultanate in present-day northern India"}, {"year": "1407", "date": "None", "content": "Zafar Khan: governor of Gujarat, declares himself as Sultan Muzaffar Shah founding the Gujarat Sultanate/Muzaffarid dynasty"}, {"year": "1414", "date": "None", "content": "Khizr Khan, deputized by Timur to be the governor of Multan takes over Delhi founding the Sayyid dynasty"}, {"year": "1424", "date": "None", "content": "Deva Raya II succeeded his father Veera Vijaya Bukka Raya as monarch of the Vijayanagara Empire"}, {"year": "1437", "date": "None", "content": "Rana Kumbha of Mewar and Rao Ranmal Rathore of Marwar defeat and take prisoner Mahmud Khalji, Sultan of the Malwa Sultanate in the Battle of Sarangpur"}, {"year": "1442", "date": "None", "content": "Rana Kumbha of Mewar defeats Mahmud Khalji in the Battle of Mandalgarh"}, {"year": "1443", "date": "None", "content": "Abdur Razzaq visits India"}, {"year": "1446", "date": "None", "content": "Rana Kumbha of Mewar defeats Mahmud Khalji in the Battle of Banas"}, {"year": "1446", "date": "None", "content": "Mallikarjuna Raya succeeds his father Deva Raya II"}, {"year": "1449", "date": "26 September", "content": "Sankardev, founder of Ekasarana Dharma was born in Nagaon, Assam."}, {"year": "1450", "date": "None", "content": "Shri Guru Ravidas Ji was born in 1450 in Varanasi. He was an Indian mystic poet-sant of the Bhakti movement during the 15th to 16th century CE. Venerated as a guru in the region of Punjab, Uttar Pradesh, Rajasthan, Maharashtra and Madhya Pradesh, the devotional songs of Ravidas have had a lasting impact upon the bhakti movement."}, {"year": "1451", "date": "19 April", "content": "Bahlul Khan Lodhi ascends the throne of the Delhi sultanate starting the Lodhi dynasty"}, {"year": "1456", "date": "None", "content": "Rana Kumbha of Mewar defeats the combined armies of Shams Khan (sultan of Nagaur) and Qutbuddin Ahmad Shah II (Sultan of Gujarat) in the Battle of Nagaur and captures Nagaur, Kasili, Khandela and Shakambhari. Nagaur Sultanate ceases to exist."}, {"year": "1469", "date": "15 April", "content": "Guru Nanak, the founder of Sikhism is born"}, {"year": "1483", "date": "14 February", "content": "Birth of Babur in Andijan, Fergana Valley in Central Asia"}, {"year": "1485", "date": "None", "content": "Saluva Narasimha Deva Raya drives out Praudha Raya ending the Sangama Dynasty"}, {"year": "1486", "date": "None", "content": "Advent of Chaitanya Mahaprabhu, founder of Gaudiya Vaishnavism and leader of the world's first civil disobedience movement, in Navadwip, West Bengal"}, {"year": "1490", "date": "None", "content": "Ahmadnagar declares independence, followed by Bijapur and Berar in the same year thus breaking up the Bahmani Sultanate."}, {"year": "1492", "date": "30 March", "content": "Satal Rathore of Marwar kills Afghan warlord Gudhla Khan in the Battle of Peepar, to rescue 140 girls abducted by the Afghans. He later succumbs to injuries sustained in the battle."}, {"year": "1498", "date": "20 May", "content": "Vasco de Gama was the first portage's sailor first voyage from Europe to India and back (in 1499)"}, {"year": "16th century", "date": "None", "content": "Marker"}, {"year": "1503", "date": "None", "content": "Kingdom of Cochin is taken over by the Portuguese creating the first European settlement in India."}, {"year": "1508", "date": "3 February", "content": "The Christian-Islamic power struggle in Europe and the Middle East. Spills over into the Indian Ocean as Battle of Chaul during the Portuguese-Mamluk War"}, {"year": "1509", "date": "3 February", "content": "Battle of Diu marks the beginning of the dominance of the Europeans in the Asian naval theater."}, {"year": "1510", "date": "20 May", "content": "Portuguese India (to 1961)"}, {"year": "1518", "date": "None", "content": "Kingdom of Mewar under Rana Sanga defeats Lodi Empire under Ibrahim Lodhi in the Battle of Khatoli, gains control over north eastern Rajasthan."}, {"year": "1519", "date": "None", "content": "Kingdom of Mewar under Rana Sanga defeats the Malwa Sultanate and the Gujarat Sultanate in the Battle of Gagron, obtains control of Malwa."}, {"year": "1519", "date": "None", "content": "The Kingdom of Mewar under Rana Sanga again defeats Lodi Empire under Ibrahim Lodi in the Battle of Dholpur, extends control up to Agra."}, {"year": "1520", "date": "None", "content": "Vijayanagara Empire under Krishnadevaraya defeats the Sultanate of Bijapur in the Battle of Raichur."}, {"year": "1520", "date": "None", "content": "Rana Sanga leads a coalition of Rajput armies to invade the Gujarat Sultanate, reinstates Raimal as the Rao of Idar. The Sultan of Gujarat is forced to flee to Muhammadabad."}, {"year": "1520", "date": "None", "content": "Death of mystic poet-sant of the Bhakti movement Shri Guru Ravidas."}, {"year": "1522", "date": "None", "content": "Portuguese land on the Coromandel Coast"}, {"year": "1523", "date": "None", "content": "Portuguese explorers established Santhome Church above the Tomb of Saint Thomas the Apostle in Chennai."}, {"year": "1526", "date": "21 April", "content": "Sultan Ibrahim Lodi, of the Delhi Sultanate, angers local nobles, who respond by inviting Babur, the Mughal ruler of Kabul, to invade Delhi and Agra. The local population, plus the possession of artillery, assists Babur in killing the Sultan (whose soldiers desert him) at the Battle of Panipat."}, {"year": "1527", "date": "17 March", "content": "Babur bribes Mewar general Silhadi promising Silhadi a kingdom, if Silhadi betrays Mewar King Rana Sanga in Battle of Khanwa, thus leading to the annexation of Mewar."}, {"year": "1530", "date": "None", "content": "Astronomer-mathematician Jyeṣṭhadeva of the Kerala school of astronomy and mathematics writes the Yuktibhāṣā, a major treatise on mathematics and astronomy in Malayalam"}, {"year": "1530", "date": "28 March,27 January", "content": "Babur[8] completes his Baburnama, reflecting on society, politics, economics, history, geography, nature, flora and fauna, which to this day is a standard textbook in 25 countries. Babur dies, and is succeeded by his son Humayun."}, {"year": "1532", "date": "None", "content": "Ahoms under king Suhungmung defeat Turbak Khan of the Bengal Sultanate in Battle of Hatbor."}, {"year": "1539", "date": "None", "content": "Battle of Chausa fought between Humayun and Sher Shah Suri in which Humayun defeated."}, {"year": "1539", "date": "None", "content": "Guru Angad Dev becomes second guru of Sikhs."}, {"year": "1540", "date": "18 September", "content": "Battle of Kannauj fought between Humayun and Sher Shah Suri and Humayun was completely defeated. Humayun lost the Mughal empire to Afghans (Suri Dynasty), and passed 12 years in exile."}, {"year": "1540", "date": "9 May", "content": "Birth of Maharana Pratap Singh of Mewar ( son of Maharana Udai Singh II )"}, {"year": "1542", "date": "15 October", "content": "Birth of Akbar at Umerkot."}, {"year": "1545", "date": "22 May", "content": "Death of Sher Shah Suri and succeeded by Islam Shah Suri."}, {"year": "1552", "date": "26 March", "content": "Guru Amar Das becomes third Guru of Sikhs."}, {"year": "1554", "date": "22 November", "content": "Death of Islam Shah Suri."}, {"year": "1555", "date": "22 May", "content": "Humayun regained the throne of Delhi from the hands of weak successors of Sher Shah."}, {"year": "1556", "date": "27 January", "content": "Humayun converts from Sunni Islam to Shia Islam, to gain the alliance of the Shah of Persia. Humayun dies, and is succeeded by his son Akbar."}, {"year": "1556", "date": "7 October", "content": "Hindu king Hemu defeats Mughal forces in the Battle of Tughlaqabad"}, {"year": "1556", "date": "5 November", "content": "Hindu king Hemu establishes 'Hindu Raj' in North India and bestowed with title of \"Vikramaditya\"; Second Battle of Panipat fought between Hemu and Akbar's forces in which Hemu is killed."}, {"year": "1565", "date": "26 January", "content": "Battle of Talikota results in the rout of Vijayanagara empire."}, {"year": "1568", "date": "None", "content": "Paradesi Synagogue, the first Jewish synagogue in India constructed by the Paradesi Jews."}, {"year": "1572", "date": "None", "content": "Akbar annexes Gujarat, also shifts the Mughal capital to Fatehpur Sikri where a new township and citadel containing buildings of a unique all-India character—inspired by the architecture of Bengal, Gujarat, Malwa, Kashmir as well as the Timurid world—is born."}, {"year": "1574", "date": "1 September", "content": "Guru Ram Das becomes fourth Guru of Sikhs."}, {"year": "1574", "date": "None", "content": "Akbar annexes Bengal."}, {"year": "1581", "date": "1 September", "content": "Guru Arjan Dev becomes fifth Guru of Sikhs."}, {"year": "1582", "date": "None", "content": "Maharana Pratap defeats Mughal Forces of Akbar in Battle of Dewair in present-day Rajasthan[33]"}, {"year": "1586", "date": "6 October", "content": "Akbar annexes Kashmir."}, {"year": "1589", "date": "None", "content": "Harmandir Sahib (Golden Temple) build in Amritsar by Guru Arjan"}, {"year": "1600", "date": "31 December", "content": "East India Company is formed in England. Gets exclusive trading rights with India."}, {"year": "17th century", "date": "None", "content": "Marker"}, {"year": "1602", "date": "None", "content": "Dutch came to India at Pulicut (back to 1825)."}, {"year": "1605", "date": "27 October", "content": "Akbar dies, and is succeeded by his son Jahangir."}, {"year": "1606", "date": "25 May", "content": "Guru Hargobind is selected to becomes the sixth guru of Sikhs by Guru Arjan"}, {"year": "1606", "date": "30 May", "content": "Guru Arjan is tortured and killed under orders of Mughal Emperor Jahangir for refusing to convert to Islam."}, {"year": "1612", "date": "30 November", "content": "British India (to 1947)"}, {"year": "1612", "date": "24 August", "content": "East India Company enters into a trade agreement with the Mughal Emperor Jahangir"}, {"year": "1616", "date": "None", "content": "Susenghphaa, ruler of the Ahom kingdom defeats Mughal forces in a land and naval battle at Bharali, Assam.[34]"}, {"year": "1621", "date": "None", "content": "Sikhs army led by Guru Hargobind defeat Mughals in the Battle of Rohilla"}, {"year": "1628", "date": "None", "content": "Jahangir announces \"Chain of Justice\" outside his palace that anyone can ring the bell and get a personal hearing with the emperor. Jahangir dies, and is succeeded by his son Shah Jahan."}, {"year": "1630", "date": "19 February", "content": "Birth of Chatrapati Shivaji maharaj."}, {"year": "1634", "date": "14 April", "content": "Sikhs army led by Guru Hargobind defeat Mughals in the Battle of Amritsar (1634)"}, {"year": "1634", "date": "15 October", "content": "Sikhs army of 2000 led by Guru Hargobind defeat a Mughal army of 36000 in the Battle of Lahira and kill the Mughal generals Qumar Beg and Lala Beg."}, {"year": "1635", "date": "25 April", "content": "Sikhs army of 1800 led by Guru Hargobind defeat a Mughal army of 52000 in the Battle of Kartarpur"}, {"year": "1644", "date": "8 March", "content": "Guru Har Rai becomes seventh guru of Sikhs"}, {"year": "1644", "date": "None", "content": "Shivaji takes oath of Independence at Raireshwar."}, {"year": "1640", "date": "None", "content": "Rani Karnavati of the Garhwal Kingdom repels and defeats invasion attempt by Mughal army of Shah Jahan.[35]"}, {"year": "1658", "date": "None", "content": "Shah Jahan completes Taj Mahal, Jama Masjid, and Red Fort. Imperial treasuries drained by architectural and military overexpenditures. Shah Jahan put under house arrest, and is succeeded by his son Aurangzeb."}, {"year": "1659", "date": "19 February", "content": "Shivaji's ill-equipped and small Maratha army defeat numerically much larger Adilshahi troops at the Battle of Pratapgarh marking the first victory of the Maratha Empire. Shivaji personally kills Adilshahi commander Afzal Khan (general)."}, {"year": "1659", "date": "27 December", "content": "Marathas under Shivaji defeat the Adilshahi troops in the Battle of Kolhapur"}, {"year": "1660", "date": "13 July", "content": "Maratha army of 600 defeats a much larger army of the Bijapur Sultanate of 10,000 in the Battle of Pavan Khind, near the city of Kolhapur."}, {"year": "1661", "date": "3 February", "content": "Marathas under Shivaji defeat Mughal Empire forces in the Battle of Umberkhind."}, {"year": "1661", "date": "6 October", "content": "Guru Har Krishan becomes eight guru of Sikhs."}, {"year": "1664", "date": "6–10 January", "content": "Marathas under Shivaji defeat Mughal Empire forces in the Battle of Surat."}, {"year": "1665", "date": "13 February", "content": "Shivaji conducts a raid on the Portuguese colony in Basrur and gains a large booty which enables him to strengthen the base of his new kingdom by building a strong navy and forts."}, {"year": "1665", "date": "20 March", "content": "Guru Tegh Bahadur becomes ninth Guru of Sikhs."}, {"year": "1665", "date": "11 June", "content": "Treaty of Purandar (1665) (or पुरंदर चा तह) was signed on 11 June 1665, between Shivaji and the Rajput ruler Jai Singh I."}, {"year": "1669", "date": "28 November", "content": "Jats defeats the Mughal Empire in the Battle of Tilpat takes control of Mathura"}, {"year": "1670", "date": "4 February", "content": "Marathas under Shivaji capture the fort of Sinhagad (then known as Kondhana) from the Mughals in the Battle of Sinhagad."}, {"year": "1671", "date": "None", "content": "Ahom kingdom defeats the Mughal Empire in the Battle of Saraighat, takes back control of Guwahati"}, {"year": "1671", "date": "None", "content": "Chhatrasal revolts against the Mughal Empire with an army of only 5 horsemen and 25 swordsmen. In ten years he conquers a large tract of land between Chitrakoot, Chhatarpur and Panna in the east and Gwalior in the west, and from Kalpi in the north to Sagar, Garhakota, Shahgarh and Damoh in the south."}, {"year": "1672", "date": "February", "content": "Maratha forces under Prataprao Gujar defeat a Mughal army twice its size in the Battle of Salher"}, {"year": "1672", "date": "None", "content": "Marathas defeat Mughal forces and capture Kolistan in present day Palghar district of Maharashtra and the southern regions of Gujarat, in Maratha occupation of Kolistan (1672)"}, {"year": "1672", "date": "6 June", "content": "Forces led by Shivaji defeat Aurangzeb's troops, and establishes Maratha Empire. Shivaji is crowned Chhatrapati."}, {"year": "1675", "date": "6 May", "content": "Marathas defeat the Bijapur Sultanate and capture the Fortress of Ponda after the Siege of Ponda"}, {"year": "1675", "date": "24 November", "content": "Guru Tegh Bahadur, the ninth Guru of Sikhs is tortured and executed in Delhi by the order of Aurangzeb for his support for the Kashmiri Hindus to practice their religion and for refusing to convert to Islam.\nGuru Gobind Singh becomes tenth Guru of Sikhs."}, {"year": "1680", "date": "3 April", "content": "Shivaji dies of fever at Raigad."}, {"year": "1680", "date": "20 July", "content": "Sambhaji becomes 2nd Chhatrapati of the Maratha Empire"}, {"year": "1680", "date": "None", "content": "Kingdom of Venad defeats the Mughal Empire in the Battle of Manacaud"}, {"year": "1681", "date": "None", "content": "Aurangzeb invades the Deccan"}, {"year": "1681", "date": "31 January – 2 February", "content": "Maratha ruler Sambhaji attacks and sacks the Mughal city Burhanpur"}, {"year": "1682", "date": "August", "content": "Ahom kingdom defeats the Mughal Empire in the Battle of Itakhuli, takes back control of Kamrup region"}, {"year": "1684", "date": "None", "content": "Marathas under Sambhaji repel a Mughal attempt to invade Konkan. Mughals are forced into a slow retreat and suffer great losses."}, {"year": "1687", "date": "16 December", "content": "Marathas under Sambhaji defeat the Mughal Army in the Battle of Wai. However, Maratha General Hambirrao Mohite is killed."}, {"year": "1688", "date": "None", "content": "The Sikandara was plundered by Rajaram Jat. Even the skeleton of Akbar the great, was taken out and the bones were consumed to flames."}, {"year": "1689", "date": "11 March", "content": "After being ambushed and captured by the Mughals, Sambhaji is tortured and killed for refusing to convert to Islam.\nRajaram I becomes the third Chhatrapati of the Maratha Empire."}, {"year": "1691", "date": "None", "content": "Joint forces of Bhim Chand (Kahlur) of Bilaspur and Guru Gobind Singh defeat Mughal army in the Battle of Nadaun."}, {"year": "1692", "date": "December", "content": "Maratha General Santaji Ghorpade defeats Mughal General Alimardan Khan and captures him.\nMughal army under Zulfikhar Ali Khan defeated by Santaji and Dhanaji Jadhav and Zulfiquar Khan is forced to sue King Rajaram for peace"}, {"year": "1693", "date": "21 November", "content": "Maratha General Santaji Ghorpade defeats Mughal General Himmat Khan."}, {"year": "1695", "date": "20 November", "content": "Maratha General Santaji Ghorpade defeats and kills Mughal General Kasim Khan."}, {"year": "1696", "date": "None", "content": "Sikhs under Guru Gobind Singh defeat Mughal forces in the Battle of Guler (1696)"}, {"year": "1696", "date": "20 November", "content": "Danish India (to 1869)"}, {"year": "1699", "date": "3 October", "content": "Guru Gobind Singh, the 10th Guru of Sikhs creates Khalsa, the saint-soldier at Anandpur Sahib, Punjab."}, {"year": "18th century", "date": "None", "content": "Marker"}, {"year": "1700", "date": "None", "content": "Sikhs army of 1000 under Guru Gobind Singh defeats Mughal army numbering 10,000 in the Battle of Anandpur (1700)"}, {"year": "1700", "date": "3 March", "content": "Rajaram I dies. The infant Shivaji II becomes the Chhatrapati of the Maratha Empire, with his mother Tarabai as the regent. She continues the Maratha battles against the Mughal Empire, leading the Maratha army herself."}, {"year": "1702", "date": "None", "content": "Sikhs army under Guru Gobind Singh defeats Mughal army in the Battle of Nirmohgarh (1702)"}, {"year": "1707", "date": "13 February", "content": "Birth of Suraj Mal son of Badan Singh"}, {"year": "1707", "date": "3 March", "content": "Death of Aurangzeb the mughal monarch."}, {"year": "1708", "date": "7 October", "content": "Guru Gobind Singh is assassinated by Mughals and the Guru Granth Sahib becomes the eternal Guru of the Sikhs."}, {"year": "1710", "date": "12 May", "content": "Sikh army under Banda Singh Bahadur defeats Mughal Empire in the Battle of Chappar Chiri and establishes Sikh rule from Lahore to Delhi."}, {"year": "1717", "date": "None", "content": "Meitei king Pamheipa (Gharib Nawaz (Manipur)) introduces Hinduism as the state religion and changes the name of the kingdom to the Sanskrit Manipur."}, {"year": "1721", "date": "March – October", "content": "Attingal Outbreak takes place"}, {"year": "1721", "date": "13–14 November", "content": "Madras cyclone occurs"}, {"year": "1720", "date": "None", "content": "Bajirao I appointed by Shahu Maharaj as Peshwa (prime minister) who would later expand the Maratha empire to cover most of present-day India."}, {"year": "1724", "date": "None", "content": "Meitei king Gharib Nawaz of the Ningthouja dynasty invades Burma."}, {"year": "1728", "date": "28 February", "content": "Bajirao I defeats the combined forces of the Mughal Empire and the Nizam of Hyderabad in the Battle of Palkhed"}, {"year": "1729", "date": "March", "content": "Maratha Empire under Bajirao defeats Mughal Empire, in response for an appeal for help from Chhatrasal, ruler of Bundelkhand in the Battle of Bundelkhand"}, {"year": "1731", "date": "None", "content": "Maratha Empire under Bajirao defeats Mughal Empire and Maratha rebel factions in the Battle of Dabhoi"}, {"year": "1737", "date": "16 March", "content": "Marathas under Bajirao I defeat the Mughal Empire in the Battle of Delhi (1737)"}, {"year": "1737", "date": "24 December", "content": "Marathas defeat a combined army of the Mughal Empire, Nizam of Hyderabad, Nawab of Awadh and Nawabs of Bhopal in the Battle of Bhopal"}, {"year": "1739", "date": "17 February – 16 May", "content": "Marathas under Bajirao I defeat the Portuguese in the Battle of Vasai, Portuguese army and administration pulled out of Baçaim (Vasai)."}, {"year": "1740", "date": "May", "content": "Raghoji I Bhonsle of the Maratha Empire defeats and kills Dost Ali Khan the Mughal Nawab of Arcot in the Battle of Damalcherry.[36]"}, {"year": "1741", "date": "26 March", "content": "Maratha army defeats the Nawab of Carnatic and captures Trichinopoly after the Siege of Trichinopoly (1741)"}, {"year": "1741", "date": "10 August", "content": "Kingdom of Travancore under Marthanda Varma defeats the Dutch Empire in the Battle of Colachel."}, {"year": "1753", "date": "10 May", "content": "Jats under Suraj Mal defeat the Mughal Empire in the Capture of Delhi (1753)"}, {"year": "1753", "date": "15 August", "content": "Treaty of Mavelikkara signed between the Kingdom of Travancore and the Dutch East India Company, effectively ending the political and commercial dominance of the Dutch on the Kerala coast and beginning of the end of Dutch influence in India."}, {"year": "1754", "date": "20 January – 18 May", "content": "Bharatpur State defeat the Marathas in Battle of Kumher"}, {"year": "1756", "date": "None", "content": "Black Hole of Calcutta infamous incident where soldiers of East India Company were held hostage in tortuous conditions, later served as a precedent for the Battle of Plassey"}, {"year": "1757", "date": "16 January", "content": "Maratha Empire defeats Durrani Empire, in the Battle of Narela."}, {"year": "1757", "date": "23 June", "content": "British East India Company defeats the Nawab of Bengal in the Battle of Plassey, marking the beginning of British conquests in India."}, {"year": "1757", "date": "11 August", "content": "Maratha Empire defeats Rohilla Afghans in the Battle of Delhi (1757), captures Delhi."}, {"year": "1757", "date": "12 February", "content": "Jats defeats Durrani Empire, in the Battle of Bharatpur (1757)"}, {"year": "1758", "date": "None", "content": "Third Carnatic War"}, {"year": "1758", "date": "28 April", "content": "Maratha Empire led by Raghunathrao and Mahadaji Shinde defeats Durrani Empire in the Battle of Attock (1758), captures Attock."}, {"year": "1758", "date": "8 May", "content": "Maratha Empire led by Raghunathrao, Malhar Rao Holkar and Tukoji Rao Holkar defeats Durrani Empire in the Battle of Peshawar (1758), captures Peshawar."}, {"year": "1759", "date": "None", "content": "French India (to 1954)"}, {"year": "1759", "date": "None", "content": "Maratha Empire supported by Sikh Sukerchakia Misl defeats Durrani Empire in the Battle of Lahore (1759)"}, {"year": "1760", "date": "3 January", "content": "Marathas comprehensively defeat the Nizam in the Battle of Udgir.\nMaratha Empire reaches its zenith."}, {"year": "1760", "date": "None", "content": "Battle at Wandewash, British troops beat French"}, {"year": "1761", "date": "January", "content": "The Marathas are routed in the Third Battle of Panipat on 14 January 1761, by the Afghans led by Ahmad Shah Durrani, also known as Ahmad Shah Abdali. The battle is considered one of the largest battles fought in the 18th century."}, {"year": "1761", "date": "12 June", "content": "Capture of Agra Fort by the Kingdom of Bharatpur led by king Suraj Mal, defeating the armies of the Mughal Empire and Rohilla Afghans"}, {"year": "1761", "date": "August", "content": "The Sukerchakia Misl of Dal Khalsa (Sikh Empire) defeats the Durrani Empire in the Battle of Sialkot (1761)"}, {"year": "1761", "date": "September", "content": "The Sikh Confederacy defeats the Durrani Empire in the Battle of Gujranwala (1761)"}, {"year": "1762", "date": "5 February", "content": "Vadda Ghalughara, the massacre of 30,000 Sikhs, mostly non-combatants, by the army of Ahmad Shah Durrani"}, {"year": "1762", "date": "May", "content": "Sikh Misls under Jassa Singh Ahluwalia defeat the Durrani Empire in the Battle of Harnaulgarh"}, {"year": "1763", "date": "10 August", "content": "Maratha Empire led by Madhavrao I defeats the Nizam of Hyderabad in the Battle of Rakshasbhuvan and gains territory."}, {"year": "1763", "date": "25 December", "content": "Suraj Mal dies"}, {"year": "1764", "date": "26 February", "content": "Sikh Misls under Jassa Singh Ahluwalia defeat the Durrani Empire in the Battle of Sirhind (1764) and capture Sirhind"}, {"year": "1764", "date": "22 October", "content": "Battle of Buxar (British victory against allied Mughal, Bengal and Oudh forces)"}, {"year": "1765", "date": "February", "content": "Kingdom of Bharatpur led by king Jawahar Singh defeats the Mughal Empire in the Battle of Delhi (1764)"}, {"year": "1767", "date": "None", "content": "First Anglo-Mysore War begins, in which Hyder Ali of Mysore defeats the armies of the British East India Company."}, {"year": "1770", "date": "None", "content": "Great Bengal famine of 1770, estimated to have caused the deaths of about 10 million people.[37] Warren Hastings's 1772 report estimated that a third of the population in the affected region starved to death. The famine is attributed to failed monsoon and exploitative policies of the East India Company.[38]"}, {"year": "1771", "date": "None", "content": "Marathas led by Mahadaji Shinde defeat Rohilla Afghans and re-capture Delhi and parts of North India, thus reasserting their supremacy in north India. As revenge for the losses in the Battle of Panipat, the Maratha army devastated Rohilkhand by looting and plundering and also took the members of royal family as captives."}, {"year": "1772", "date": "22 May", "content": "Ram Mohan Roy Born (to 1833)"}, {"year": "1773", "date": "None", "content": "Narayanrao Peshwa is murdered by his uncle Raghunathrao's wife in front of Raghunathrao."}, {"year": "1773", "date": "None", "content": "Regulating Act of 1773"}, {"year": "1773", "date": "None", "content": "Warren Hastings appointed as first Governor-General of Bengal"}, {"year": "1774", "date": "None", "content": "Chief Justice of the Maratha Empire, Ram Shastri passes death sentence against the ruling Peshwa Raghunathrao for murdering his nephew."}, {"year": "1775", "date": "None", "content": "First Anglo-Maratha War"}, {"year": "1775", "date": "June", "content": "Alliance of Shekhawat chieftains and Kingdom of Jaipur defeat the Mughal Empire supported by Baloch chieftains in the Battle of Mandan"}, {"year": "1779", "date": "None", "content": "Maratha sardar Mahadji Shinde routs the East India Company army at the Battle of Wadgaon. War ends with the restoration of status quo as per Treaty of Salbai."}, {"year": "1780", "date": "None", "content": "Second Anglo-Mysore War begins."}, {"year": "1781", "date": "None", "content": "Maratha Empire defeats forces of the British East India Company in the Battle of Bhorghat."}, {"year": "1784", "date": "None", "content": "Second Anglo-Mysore War ends with the Treaty of Mangalore."}, {"year": "1784", "date": "None", "content": "Captivity of Mangalorean Catholics at Seringapatam, suffer extreme hardships, torture, death, forcibly converted to Sunni Islam. Of the 60,000–80,000 Christians taken captive, only 15,000–20,000 survive."}, {"year": "1786", "date": "None", "content": "District collectors in Bengal were made responsible for settling the revenue and collecting it."}, {"year": "1787", "date": "None", "content": "Maratha Empire defeats Tipu Sultan, the king of Mysore in the Maratha–Mysore War, resulting in the Treaty of Gajendragad. Tipu Sultan is forced to pay 4.8 million rupees as a war cost to the Marathas, an annual tribute of 1.2 million rupees and return all the territory captured by his father Hyder Ali"}, {"year": "1789", "date": "None", "content": "Third Anglo-Mysore War begins."}, {"year": "1789", "date": "None", "content": "Tipu Sultan invades Malabar (present day Kerala), destroys a number of temples including the temples of Bhagamandala, Payyavoor, Ammakoottam Mahadevi temple and Thrikkadamba Sri.mahavishnu temple. Thousands are killed, women raped and populace forced to convert to Islam,"}, {"year": "1790", "date": "None", "content": "The Marathas under Holkar and General de Boigne defeat the Rajputs of Jaipur and Mughals at the Battle of Patan, where 3000+ Rajput cavalry is killed and the entire Mughal unit vanquished. The defeat crushes Rajput hope of independence from external influence"}, {"year": "1790", "date": "May", "content": "Kingdom of Travancore defeats the Kingdom of Mysore in the Battle of Nedumkotta"}, {"year": "1792", "date": "None", "content": "Third Anglo-Mysore War ends."}, {"year": "1793", "date": "None", "content": "Birth of Rani Rashmoni, one of the pioneers of the Bengali Renaissance."}, {"year": "1795", "date": "11 March", "content": "Maratha Empire defeats the Nizam of Hyderabad in the Battle of Kharda, Nizam ceded territory."}, {"year": "1795", "date": "13 August", "content": "Death of Ahilyabai Holkar"}, {"year": "1796", "date": "None", "content": "Ching-Thang Khomba moves Manipur's capital to Kangla"}, {"year": "1798", "date": "None", "content": "Fourth Anglo-Mysore War begins."}, {"year": "1799", "date": "None", "content": "Fourth Anglo-Mysore War ends with the death of Tipu Sultan, the victory of the East India Company, and the restoration of their ally, the Wodeyar dynasty of Mysore."}, {"year": "1799", "date": "None", "content": "Polygar War"}, {"year": "1800", "date": "13 March", "content": "Death of Nana Fadnavis"}, {"year": "19th century", "date": "None", "content": "Marker"}, {"year": "1801", "date": "12 April", "content": "Maharaja Ranjit Singh establishes Khalsa rule of Punjab from Lahore. Khalsa army liberates Kashmiri Pandits and invades Afghanistan via the Khyber Pass."}, {"year": "1802", "date": "None", "content": "The Kingdom of Kottayam defeats the British East India Company in the Battle of Panamarathukotta"}, {"year": "1803", "date": "None", "content": "The Second Anglo-Maratha War begins."}, {"year": "1805", "date": "17 December", "content": "The Second Anglo-Maratha War ends."}, {"year": "1806", "date": "10 July", "content": "Vellore mutiny"}, {"year": "1807", "date": "None", "content": "Hari Singh Nalwa, commander of the Sikh Khalsa Army of the Sikh Empire defeats the Durrani Empire in the Battle of Kasur, the first in a series of battles."}, {"year": "1809", "date": "25 April", "content": "The East India Company signs the first Treaty of Amritsar with Ranjit Singh."}, {"year": "1811", "date": "28 October", "content": "The death of Yashwantrao Holkar"}, {"year": "1813", "date": "13 July", "content": "Dewan Mokham Chand and Hari Singh Nalwa, commanders of the Sikh Khalsa Army of the Sikh Empire defeat the Durrani Empire in the Battle of Attock and capture Attock"}, {"year": "1814", "date": "15 January", "content": "\"Atmiya Sabha\" is established by Raja Ram Mohan Roy."}, {"year": "1817", "date": "3 June, 20 January", "content": "The Third Anglo-Maratha War begins.\nEstablishment of Hindu College (Presidency College, now Presidency University, Kolkata)"}, {"year": "1818", "date": "March – 2 June", "content": "Sikh Empire defeats the Durrani Empire and captures Multan after the Siege of Multan (1818)."}, {"year": "1818", "date": "31 December", "content": "The Third Anglo-Maratha War ends with the defeat of Bajirao II and the end of the Maratha Empire, leaving the East India Company with control of almost the whole of India."}, {"year": "1819", "date": "3 July", "content": "Sikh Empire defeats the Durrani Empire in the Battle of Shopian and captures Srinagar and Kashmir."}, {"year": "1820", "date": "31 December", "content": "Ishwar Chandra Vidyasagar is born (to 1891)."}, {"year": "1823", "date": "5 March", "content": "Anglo-Burmese Wars (to 1826)"}, {"year": "1823", "date": "14 March", "content": "Sikh Empire defeats the Emirate of Afghanistan and the Nawab of Amb to annex Peshawar Valley, in the Battle of Nowshera"}, {"year": "1824", "date": "12 February", "content": "Dayananda Saraswati is born (to 1883)"}, {"year": "1825", "date": "December 1825 – January 1826", "content": "Battle between British East India Company and Bharatpur State"}, {"year": "1826", "date": "4 January", "content": "British rule in Burma (to 1947)"}, {"year": "1827", "date": "11 April", "content": "Jyotirao Phule is born (to 1890)"}, {"year": "1828", "date": "19 November", "content": "Rani of Jhansi Laxmi bai was born (to 1858)"}, {"year": "1829", "date": "None", "content": "Kol uprising"}, {"year": "1831", "date": "6 May", "content": "Sikh Empire defeats the Mujahideen forces of Syed Ahmad Barelvi in the Battle of Balakot"}, {"year": "1834", "date": "6 May", "content": "Sikh Empire defeats the forces of Afghan Durrani Empire in the Battle of Peshawar (1834). Peshawar becomes part of the Sikh Empire."}, {"year": "1836", "date": "18 February", "content": "Sri Ramakrishna Paramhansa is born (to 1886)"}, {"year": "1837", "date": "18 February", "content": "Hari Singh Nalwa, commander of the Sikh Khalsa Army defeats the Durrani Empire in the Battle of Jamrud and extends the frontier of Sikh Empire to beyond the Indus River right up to the mouth of the Khyber Pass."}, {"year": "1839", "date": "None", "content": "First Anglo-Afghan War"}, {"year": "1845", "date": "13 January", "content": "First Anglo-Sikh Wars (to 1849)"}, {"year": "1845", "date": "4 November", "content": "Vasudev Balwant Phadke is born (to 1883)"}, {"year": "1848", "date": "22 November", "content": "The Sikh Empire under Sher Singh Attariwalla defeats the British East India Company under Sir Hugh Gough in the Battle of Ramnagar"}, {"year": "1849", "date": "13 January", "content": "The Sikh Empire under Sher Singh Attariwalla defeats the British East India Company under Sir Hugh Gough in the Battle of Chillianwala"}, {"year": "1853", "date": "1 April", "content": "The Post Service started."}, {"year": "1853", "date": "16 April", "content": "The first railway is established between Bombay and Thane."}, {"year": "1855", "date": "31 May", "content": "Rani Rashmoni builds the Dakshineswar Kali Temple."}, {"year": "1855", "date": "30 June", "content": "Santhal rebellion"}, {"year": "1856", "date": "25 July", "content": "Hindu Widows' Remarriage Act, 1856"}, {"year": "1856", "date": "23 July", "content": "Bal Gangadhar Tilak is born (to 1920)"}, {"year": "1856", "date": "20 August", "content": "Narayana Guru is born (to 1928)"}, {"year": "1857", "date": "10 May", "content": "British victory in Indian Rebellion of 1857.\nLast Mughal Emperor Bahadur Shah Zafar was deposed by British East India Company and India transferred to British Crown."}, {"year": "1857", "date": "18 July, 24 January", "content": "India's first three universities, the University of Mumbai, the University of Madras and the University of Calcutta, are established."}, {"year": "1858", "date": "18 June 1858", "content": "Rani of Jhansi, Rani Lakshmibai died"}, {"year": "1858", "date": "1 November", "content": "British Raj (to 1947)"}, {"year": "1858", "date": "7 November", "content": "Bipin Chandra Pal is born (to 1932)"}, {"year": "1859", "date": "18 April", "content": "Death of Tatya Tope"}, {"year": "1861", "date": "7 May", "content": "Rabindranath Tagore is born."}, {"year": "1862", "date": "None", "content": "The high courts of Calcutta, Madras, and Bombay are established.[39]"}, {"year": "1863", "date": "12 January", "content": "Swami Vivekanand is born (to 1902)"}, {"year": "1865", "date": "28 January", "content": "Lala Lajpat Rai is born (to 1928)"}, {"year": "1867", "date": "31 March", "content": "\"Prarthana Samaj\" established earlier known as \"Atmiya Sabha\", \"Tahzeeb-ul-Akhlaq\" was started"}, {"year": "1869", "date": "2 October", "content": "Mahatma Gandhi is born (to 30 January 1948)\nThakkar Bapa is born (to 1951)"}, {"year": "1873", "date": "24 September", "content": "Jyotirao Phule establishes the Satyashodhak Samaj society."}, {"year": "1875", "date": "10 April", "content": "\"Arya Samaj\" is established."}, {"year": "1875", "date": "None", "content": "Aligarh Muslim University"}, {"year": "1875", "date": "None", "content": "Deccan Riots"}, {"year": "1876", "date": "25 December", "content": "Muhammad Ali Jinnah was born (1876–1948)"}, {"year": "1877", "date": "1 January", "content": "The first Delhi Durbar"}, {"year": "1883", "date": "30 October", "content": "Maharishi Dayanand Saraswati dies"}, {"year": "1885", "date": "28 December", "content": "The Indian National Congress is established[40]"}, {"year": "1889", "date": "14 November", "content": "Jawaharlal Nehru is born (to 1964)."}, {"year": "1889", "date": "3 December", "content": "Khudiram Bose is born (to 1908)."}, {"year": "1891", "date": "14 April", "content": "B. R. Ambedkar is born (to 1956)."}, {"year": "1891", "date": "31 March", "content": "Anglo-Manipur War."}, {"year": "1895", "date": "11 May", "content": "jiddu krishnamurti is born (to 17 February 1986)."}, {"year": "1897", "date": "23 January", "content": "Subhas Chandra Bose is born (to 1945); the first fingerprint bureau of India is established in Calcutta."}, {"year": "1897", "date": "11 June", "content": "Ram Prasad Bismil is born"}, {"year": "1897", "date": "22 June", "content": "Chapekar brothers assassinate W.C.Rand."}, {"year": "20th century", "date": "None", "content": "Marker"}, {"year": "1900", "date": "3 March", "content": "Maghfoor Ahmad Ajazi is born (to 1966)."}, {"year": "1902", "date": "None", "content": "Anushilan Samiti, revolutionary association formed."}, {"year": "1903", "date": "11 December", "content": "British expedition to Tibet"}, {"year": "1903", "date": "1 January", "content": "Delhi Durbar Second Time."}, {"year": "1904", "date": "5 November", "content": "University Act"}, {"year": "1905", "date": "None", "content": "Bharat Sevak Samaj founded by Gopal Krishna Gokhale."}, {"year": "1905", "date": "16 October", "content": "Partition of Bengal (1905)"}, {"year": "1906", "date": "None", "content": "Jugantar formed."}, {"year": "1906", "date": "30 December", "content": "Muslim League formed in Dacca."}, {"year": "1907", "date": "None", "content": "Surat Split"}, {"year": "1908", "date": "None", "content": "Alipore bomb case"}, {"year": "1909", "date": "None", "content": "Morley-Minto Reforms"}, {"year": "1911", "date": "None", "content": "Cancellation of Partition of Bengal"}, {"year": "1911", "date": "None", "content": "Delhi Durbar Third Time"}, {"year": "1911", "date": "12 December", "content": "The British government moves the capital from Calcutta to Delhi.[41]"}, {"year": "1912", "date": "None", "content": "Delhi conspiracy case"}, {"year": "1913", "date": "None", "content": "Gadar Party formed."}, {"year": "1913", "date": "None", "content": "Rabindranath Tagore won Nobel Prize in Literature"}, {"year": "1914", "date": "None", "content": "Hindu–German Conspiracy"}, {"year": "1915", "date": "None", "content": "Ghadar conspiracy"}, {"year": "1915", "date": "None", "content": "Provisional Government of India formed in Kabul."}, {"year": "1915", "date": "None", "content": "Mahatma Gandhi returns to India."}, {"year": "1916", "date": "None", "content": "Lucknow Pact"}, {"year": "1917", "date": "None", "content": "Champaran Satyagraha"}, {"year": "1917", "date": "None", "content": "Justice Party (India) is founded"}, {"year": "1918", "date": "None", "content": "Kheda Satyagraha and Ahmedabad Mill Strike"}, {"year": "1919", "date": "13 April", "content": "Jallianwala Bagh massacre"}, {"year": "1919", "date": "None", "content": "Montagu–Chelmsford Reforms"}, {"year": "1919", "date": "18 March", "content": "Rowlatt Act is passed\nDiarchy"}, {"year": "1920", "date": "None", "content": "Non-cooperation movement Khilafat Movement"}, {"year": "1922", "date": "5 February", "content": "Chauri Chaura incident"}, {"year": "1924", "date": "None", "content": "The Hindustan Socialist Republican Association is formed."}, {"year": "1925", "date": "9 August", "content": "Kakori conspiracy"}, {"year": "1925", "date": "27 September", "content": "Rashtriya Swayamsevak Sangh (RSS) is founded."}, {"year": "1927", "date": "20 March", "content": "Mahad Satyagraha"}, {"year": "1927", "date": "November", "content": "Simon Commission"}, {"year": "1928", "date": "None", "content": "Bardoli Satyagraha"}, {"year": "1929", "date": "None", "content": "Central Assembly bombed by Bhagat Singh and Batukeshwar Dutt."}, {"year": "1929", "date": "None", "content": "Purna Swaraj resolution."}, {"year": "1930", "date": "None", "content": "Salt Satyagraha, the civil disobedience movement, begins with the Dandi march."}, {"year": "1930", "date": "None", "content": "The first Round Table Conferences (India)"}, {"year": "1931", "date": "March", "content": "Gandhi–Irwin Pact"}, {"year": "1931", "date": "23 March", "content": "Bhagat Singh, Rajguru and Sukhdev martyred"}, {"year": "1931", "date": "September–December", "content": "The second Round Table Conferences (India)"}, {"year": "1932", "date": "24 September", "content": "Poona Pact"}, {"year": "1932", "date": "16 August", "content": "Communal Award"}, {"year": "1932", "date": "November–December", "content": "The third Round Table Conferences (India)"}, {"year": "1935", "date": "August", "content": "Government of India Act 1935"}, {"year": "1937", "date": "None", "content": "1937 Indian provincial elections"}, {"year": "1939", "date": "None", "content": "The All India Forward Bloc established by Subhas Chandra Bose"}, {"year": "1940", "date": "23 March", "content": "Lahore Resolution"}, {"year": "1940", "date": "None", "content": "The All-India Jamhur Muslim League established by Maghfoor Ahmad Ajazi to support a united India"}, {"year": "1940", "date": "8 August", "content": "August offer 1940"}, {"year": "1942", "date": "late March", "content": "Cripps' mission"}, {"year": "1942", "date": "August", "content": "1. Quit India Movement2. The Indian National Army is established by Subhas Chandra Bose."}, {"year": "1943", "date": "None", "content": "Arzi Hukumat-e-Azad Hind, the Provisional Government of Free India is formed by Netaji."}, {"year": "1944", "date": "None", "content": "Subhas Chandra Bose calls Mahatma Gandhi the Father of the Nation."}, {"year": "1945", "date": "18 August", "content": "Subhas Chandra Bose death in plane crash at Taiwan."}, {"year": "1945", "date": "None", "content": "Wavell Plan, Simla Conference"}, {"year": "1946", "date": "February", "content": "Royal Indian Navy mutiny"}, {"year": "1946", "date": "March", "content": "Cabinet Mission"}, {"year": "1946", "date": "16 August", "content": "Direct Action Day/Great Calcutta Killings"}, {"year": "1946", "date": "October–November", "content": "Noakhali riots"}, {"year": "1947", "date": "July", "content": "Indian Independence Act 1947 by British Raj"}, {"year": "1947", "date": "None", "content": "Partition of India and Pakistan becomes an independent state on 14 August 1947.[40]"}, {"year": "1947", "date": "None", "content": "Freedom from British Raj."}, {"year": "1947", "date": "None", "content": "Hundreds of thousands die in widespread communal bloodshed after partition, continuing to 1948."}, {"year": "1948", "date": "30 January", "content": "Mahatma Gandhi is assassinated by Nathuram Godse."}, {"year": "1948", "date": "None", "content": "War with Pakistan over disputed territory of Kashmir."}, {"year": "1948", "date": "None", "content": "Telangana and other princely states are integrated into Indian union."}, {"year": "1950", "date": "26 January", "content": "India became a republic."}, {"year": "1951", "date": "None", "content": "Reconstruction of the Somnath temple under the orders of the Home Minister of India Vallabhbhai Patel.[42]"}, {"year": "1951", "date": "None", "content": "Congress Party wins first general elections under leadership of Jawaharlal Nehru (to 1952)."}, {"year": "1955", "date": "None", "content": "Nationalisation of the Indian insurance sector. Establishment of LIC."}, {"year": "1956", "date": "14 October", "content": "B. R. Ambedkar converted to Buddhism along with 600,000 followers."}, {"year": "1956", "date": "6 December", "content": "B. R. Ambedkar died."}, {"year": "1962", "date": "None", "content": "War over disputed territory of Kashmir[40] with China."}, {"year": "1962", "date": "None", "content": "India seizes Diu, Daman and Goa from Portuguese India."}, {"year": "1964", "date": "27 May", "content": "Death of Prime Minister Jawaharlal Nehru."}, {"year": "1965", "date": "6–23 September", "content": "Second war with Pakistan over Kashmir."}, {"year": "1966", "date": "11 January", "content": "Prime Minister Lal Bahadur Shastri's mysterious death in Tashkent."}, {"year": "1966", "date": "None", "content": "Nehru's daughter Indira Gandhi becomes prime minister."}, {"year": "1969", "date": "19 July", "content": "Nationalisation of 14 major private Banks."}, {"year": "1969", "date": "15 August", "content": "ISRO formed under UAE."}, {"year": "1971", "date": "3–16 December", "content": "Third war with Pakistan, culminating in the creation of Bangladesh"}, {"year": "1971", "date": "None", "content": "Twenty-year treaty of friendship signed with Soviet Union."}, {"year": "1974", "date": "None", "content": "India Smiling Buddha first nuclear device in underground test."}, {"year": "1975", "date": "None", "content": "Indira Gandhi declares a state of emergency after being found guilty of electoral malpractice."}, {"year": "1975", "date": "None", "content": "Nearly 1,000 political opponents imprisoned and programme of compulsory birth control introduced. (to 1977)"}, {"year": "1977", "date": "None", "content": "Indira Gandhi's Congress Party loses general elections. Janata Party comes to power. The Communist Party of India comes into power in West Bengal."}, {"year": "1979", "date": "None", "content": "The Janata Party splits. Chaudhary Charan Singh becomes Prime Minister."}, {"year": "1980", "date": "None", "content": "Indira Gandhi returns to power heading the Congress party splinter group, Congress (Indira)."}, {"year": "1983", "date": "None", "content": "N. T. Rama Rao NTR's nine-month-old Telugu Desam assumes power in AP becoming a challenger post Loknayak Jayprakash Narayan against Indira Gandhi."}, {"year": "1983", "date": "None", "content": "India won World Cup for the first time, in one day international Cricket led by Kapil Dev."}, {"year": "1984", "date": "None", "content": "Troops storm Golden Temple, the Sikhs' most holy shrine, after Jarnail Singh Bhindranwale seeks refuge inside. There are a movement to flush out Sikh separatism and calls for secularism, called Operation Blue Star. \"Anti-Sikh Riots 1984\"."}, {"year": "1984", "date": "None", "content": "Indira Gandhi is assassinated by her Sikh bodyguards; her son, Rajiv, takes over."}, {"year": "1984", "date": "None", "content": "Many Sikhs were killed due to the assassination of Indira Gandhi. see 1984 anti-Sikh riots."}, {"year": "1987", "date": "None", "content": "India deploys troops for peacekeeping operation in Sri Lanka's ethnic conflict."}, {"year": "1988", "date": "None", "content": "SEBI was established by The Government of India on 12 April 1988 and given statutory powers in 1992 with SEBI Act 1992 being passed by the Indian Parliament."}, {"year": "1989", "date": "None", "content": "Falling public support leads to a Congress defeat in general election."}, {"year": "1989", "date": "None", "content": "The National Front (India), headed by V. P. Singh and led by Janata Dal, is formed and storms into power with outside support from BJP and CPI."}, {"year": "1990", "date": "None", "content": "Muslim separatist groups begin campaign of violence against Hindus in Kashmir resulting in Exodus of Kashmiri Hindus."}, {"year": "1991", "date": "None", "content": "Rajiv Gandhi is assassinated by a suicide bomber sympathetic to Sri Lanka's Tamil Tigers."}, {"year": "1991", "date": "None", "content": "An economic reform programme is begun by Prime Minister P. V. Narasimha Rao."}, {"year": "1992", "date": "None", "content": "Babri Mosque in Ayodhya is demolished, triggering widespread Hindu-Muslim violence."}, {"year": "1992", "date": "None", "content": "Over 200 people die in Cuttack in Odisha, after drinking illegally brewed liquor in the 1992 Odisha liquor deaths incident."}, {"year": "1995", "date": "July", "content": "West Bengal Chief Minister Jyoti Basu made the first call from Kolkata to inaugurate the cellular services in India."}, {"year": "1996", "date": "None", "content": "Congress suffers its worst electoral defeat ever as BJP emerges as the largest single party."}, {"year": "1996", "date": "August", "content": "The Amarnath Yatra tragedy in which at least 194 pilgrims are reported to have frozen to death in northern Kashmir after being stranded by violent rain and snow storms."}, {"year": "1998", "date": "None", "content": "BJP forms coalition government under Prime Minister Atal Bihari Vajpayee."}, {"year": "1998", "date": "None", "content": "India and Pakistan carry out nuclear tests, leading to widespread international condemnation."}, {"year": "1999", "date": "February", "content": "Vajpayee makes a historic bus trip to Pakistan to meet Premier Nawaz Sharif and to sign bilateral Lahore peace declaration."}, {"year": "1999", "date": "May", "content": "Indian Army launches operations to evict Pakistani forces occupying Indian positions on the icy heights in Kargil district, known as the Kargil War."}, {"year": "1999", "date": "October", "content": "The Cyclone devastates eastern state of Odisha, leaving at least 10,000 dead."}, {"year": "2000", "date": "March", "content": "US President Bill Clinton makes a groundbreaking visit to improve ties."}, {"year": "2000", "date": "May", "content": "India marks the birth of its billionth citizen."}, {"year": "2000", "date": "November", "content": "The states of Jharkhand, Chhattisgarh and Uttarakhand were created on 15 November 2000."}, {"year": "21st century ", "date": "None", "content": "Marker"}, {"year": "2001", "date": "26 January", "content": "The 7.7 Mw  Gujarat earthquake shakes Western India with a maximum Mercalli intensity of X (Extreme), leaving 13,805–20,023 dead and about 166,800 injured."}, {"year": "2001", "date": "July", "content": "Vajpayee meets Pakistani President Pervez Musharraf in the first summit between the two neighbours in more than two years. The meeting ends without a breakthrough or even a joint statement because of differences over Kashmir."}, {"year": "2001", "date": "July", "content": "Vajpayee's BJP party declines his offer to resign over a number of political scandals and the apparent failure of his talks with Pakistani President Musharraf."}, {"year": "2001", "date": "September", "content": "US lifts sanctions which it imposed against India and Pakistan after they staged nuclear tests in 1998. The move is seen as a reward for their support for the US-led anti-terror campaign."}, {"year": "2001", "date": "October", "content": "India and Pakistan fire at each other's military posts in the heaviest firing along the dividing line of control in Kashmir for almost a year.[43]"}, {"year": "2001", "date": "October", "content": "Pakistani forces shelled the village of Arnia about three km (two miles) from the border in the early hours of Monday 6 June, killing five and wounding at least two dozen civilians.[43]"}, {"year": "2001", "date": "December", "content": "Suicide squad attacks parliament in New Delhi, killing several police. The five gunmen die in the assault."}, {"year": "2001", "date": "December", "content": "India imposes sanctions against Pakistan, to force it to take action against two Kashmir militant groups blamed for the suicide attack on parliament. Pakistan retaliates with similar sanctions, and bans the groups in January."}, {"year": "2001", "date": "December", "content": "India, Pakistan mass troops on common border amid mounting fears of a looming war."}, {"year": "2002", "date": "None", "content": "War of words between Indian and Pakistani leaders intensifies. Actual war seems imminent."}, {"year": "2002", "date": "January", "content": "India successfully test-fires a nuclear-capable ballistic missile – the Agni – off its eastern coast."}, {"year": "2002", "date": "February", "content": "Inter-religious bloodshed breaks out after 59 Hindu pilgrims returning from Ayodhya are killed in a train fire in Godhra, Gujarat. More than 1,000 people, die in subsequent riots. (Police and officials blamed the fire on a Muslim mob; a 2005 government investigation said it was an accident, though later court and SIT report held Muslim mob responsible.)"}, {"year": "2002", "date": "May", "content": "Pakistan test-fires three medium-range surface-to-surface Ghauri missiles, which are capable of carrying nuclear warheads."}, {"year": "2002", "date": "June", "content": "UK, US urge their citizens to leave India and Pakistan, while maintaining diplomatic offensive to avert war."}, {"year": "2002", "date": "July", "content": "Retired scientist and architect of India's missile programme A. P. J. Abdul Kalam is elected president."}, {"year": "2003", "date": "August", "content": "At least 50 people are killed in two simultaneous bomb blasts in Bombay."}, {"year": "2003", "date": "November", "content": "India matches Pakistan's declaration of a Kashmir ceasefire."}, {"year": "2003", "date": "December", "content": "India, Pakistan agree to resume direct air links and to allow overflights."}, {"year": "2004", "date": "January", "content": "Groundbreaking meeting is held between government and moderate Kashmir separatists."}, {"year": "2004", "date": "May", "content": "Surprise victory for Congress Party in general elections. Manmohan Singh is sworn in as prime minister."}, {"year": "2004", "date": "September", "content": "India, along with Brazil, Germany and Japan, launches an application for a permanent seat on the UN Security Council."}, {"year": "2004", "date": "November", "content": "India begins to withdraw some of its troops from Kashmir."}, {"year": "2004", "date": "December", "content": "Thousands are killed when tsunami, caused by the 2004 Indian Ocean earthquake off the Indonesian coast, devastate coastal communities in the south and in the Andaman and Nicobar Islands."}, {"year": "2005", "date": "July", "content": "More than 1,000 people are killed in floods and landslides caused by monsoon rains in Mumbai (Bombay) and Maharashtra region."}, {"year": "2005", "date": "8 October", "content": "The 7.6 Mw  Kashmir earthquake strikes with a maximum Mercalli intensity of VIII (Severe), leaving 86,000–87,351 people dead, 69,000–75,266 injured, and 2.8 million homeless."}, {"year": "2006", "date": "February", "content": "India's largest-ever rural jobs scheme is launched, aimed at lifting around 60 million families out of poverty."}, {"year": "2006", "date": "March", "content": "US and India sign a nuclear agreement during a visit by US President George W. Bush. The US gives India access to civilian nuclear technology while India agrees to greater scrutiny for its nuclear programme."}, {"year": "2007", "date": "February", "content": "India and Pakistan sign an agreement aimed at reducing the risk of accidental nuclear war."}, {"year": "2007", "date": "18 February", "content": "68 passengers, most of them Pakistanis, are killed by bomb blasts and a blaze on a train travelling from New Delhi to the Pakistani city of Lahore."}, {"year": "2007", "date": "March", "content": "Maoist rebels in Chhattisgarh state kill more than 50 policemen in a dawn attack."}, {"year": "2007", "date": "April", "content": "India's first commercial space rocket is launched, carrying an Indian satellite."}, {"year": "2007", "date": "May", "content": "Government announces its strongest economic growth figures for 20 years – 9.4% in the year to March."}, {"year": "2007", "date": "May", "content": "At least nine people are killed in a bomb explosion at the main mosque in Hyderabad. Several others are killed in subsequent rioting."}, {"year": "2007", "date": "July", "content": "India says the number of its people with HIV or AIDS is about half of earlier official tallies. Health ministry figures put the total at between 2 million and 3.1 million cases, compared with previous estimates of more than 5 million."}, {"year": "2007", "date": "July", "content": "Pratibha Patil becomes first woman to be elected president of India."}, {"year": "2008", "date": "July", "content": "Series of explosions kills 49 in Ahmedabad, in Gujarat state. The little-known terrorist group Indian Mujahideen claims responsibility."}, {"year": "2008", "date": "October", "content": "Following approval by the US Congress, President George W. Bush signs into law a nuclear deal with India, which ends a three-decade ban on US nuclear trade with Delhi."}, {"year": "2008", "date": "October", "content": "India successfully launches its first mission to the moon, the unmanned lunar probe Chandrayaan-1."}, {"year": "2008", "date": "November", "content": "The 2008 Mumbai attacks (often called the 26/11 attacks) kill 174 people, including 9 of the 10 terrorists from Lashkar-e-Taiba, an Islamic terrorist organisation based in Pakistan. India decides not to attack Pakistan in retaliation."}, {"year": "2008", "date": "December", "content": "India announces \"pause\" in peace process with Pakistan. Indian cricket team cancels planned tour of Pakistan."}, {"year": "2009", "date": "February", "content": "India and Russia sign deals worth $700 million, according to which Moscow will supply Uranium to Delhi."}, {"year": "2009", "date": "May", "content": "Resounding general election victory gives governing Congress-led alliance of PM Manmohan Singh an enhanced position in parliament, only 11 seats short of an absolute majority."}, {"year": "2009", "date": "July", "content": "Delhi court decriminalizes gay sex"}, {"year": "2010", "date": "13 February", "content": "16 people are killed in a bomb explosion at German Bakery in the city of Pune, Maharashtra."}, {"year": "2011", "date": "2 April", "content": "India wins cricket world cup after 28 years under the captaincy of Mahendra Singh Dhoni."}, {"year": "2011", "date": "13 May", "content": "After 34 years of Left Front Government, Trinamool Congress and Congress alliance come to power in West Bengal."}, {"year": "2012", "date": "25 July", "content": "Pranab Mukherjee, the former Finance Minister is elected as the 13th president of India."}, {"year": "2013", "date": "12 February", "content": "Indian helicopter bribery scandal comes to light."}, {"year": "2013", "date": "21 February", "content": "Terror attacks in Hyderabad in Dilsukhnagar area."}, {"year": "2013", "date": "5 November", "content": "Mars Orbiter Mission, is successfully launched into Mars orbit by the Indian Space Research Organisation (ISRO).[44][45][46]"}, {"year": "2014", "date": "16 May", "content": "Narendra Modi elected as prime minister of India, Congress was routed in the general elections."}, {"year": "2014", "date": "2 June", "content": "Telangana, The state of Telangana was officially formed on 2 June 2014."}, {"year": "2016", "date": "2–5 January", "content": "Terror Attacks on Pathankot Air Base.[47]"}, {"year": "2016", "date": "27 June", "content": "India becomes a member of Missile Technology Control Regime."}, {"year": "2016", "date": "27 September", "content": "India launches its first space laboratory Astrosat in its biggest project since its Mars orbiter mission in 2014."}, {"year": "2016", "date": "23 September", "content": "India signs a billion-dollar defence deal with France to buy 36 Rafale fighter jets."}, {"year": "2016", "date": "8 November", "content": "In a surprise announcement, the government withdraws high denomination notes from circulation causing chaotic scenes at banks across the country as customers try to exchange old notes."}, {"year": "2017", "date": "30 June", "content": "The Goods and Services Tax (GST) launched, the biggest tax reform in history of India."}, {"year": "2019", "date": "14 February", "content": "A convoy of vehicles carrying Central Reserve Police Force (CRPF) personnel on the Jammu–Srinagar National Highway was attacked by a vehicle-borne suicide bomber in the Pulwama district, Jammu and Kashmir, India."}, {"year": "2019", "date": "26 February", "content": "The 2019 Balakot airstrike was conducted by India, when Indian warplanes crossed the de facto border in the disputed region of Kashmir, and dropped bombs in the vicinity of the town of Balakot in Khyber Pakhtunkhwa province in Pakistan."}, {"year": "2019", "date": "27 February", "content": "The 2019 Balakot strike from Indian side was given a reply named \"Swift Retort\". After a dog fight between Pakistani and Indian Fighter Pilots. Indian Wing Commander Abhinandan Varthaman was captured by the Pakistani side. However acting to the pressure of various global leaders and bound by the Vienna Convention. Pakistan was Forced to release the Indian Pilot with all due respect."}, {"year": "2019", "date": "22 May", "content": "Narendra Modi re-elected as the Prime Minister of India, Congress routed once again"}, {"year": "2019", "date": "5 August", "content": "The state of Jammu and Kashmir divided into two separate union territories known as Jammu Kashmir and Ladakh by scrapping of Article 370 of the Constitution of India."}, {"year": "2019", "date": "11 December", "content": "The Citizenship (Amendment) Act, 2019 was passed by the Parliament of India on 11 December 2019. It amended the Citizenship Act of 1955 by providing a path to Indian citizenship for members of Hindu, Sikh, Buddhiist, Jain, Parsi, and Christian religious minorities, who had fled persecution from Pakistan, Bangladesh and Afghanistan before December 2014."}, {"year": "2020", "date": "30 January", "content": "The first COVID-19 case of the country was reported in Kerala's Thrissur district."}]